proyecto_cruz_julian/app/Controllers/AdminController.php

SELECT *
FROM `productos`
JOIN `producto_categoria` ON `producto_categoria`.`categoria_id` = `productos`.`producto_categoria`
---
    public function vista_admin(){

        $categoria = new CategoriaModel();
        $productoModel = new ProductoModel();

        $data['categorias_dropdown'] = $categoria->findAll();
        $data['producto_dropdown'] = $productoModel->join('producto_categoria', 'producto_categoria.categoria_id = productos.producto_categoria')->findAll();