proyecto_cruz_julian/app/Controllers/Home.php

SELECT *
FROM `productos`
JOIN `producto_categoria` ON `producto_categoria`.`categoria_id` = `productos`.`producto_categoria`
SELECT *
FROM `productos`
ORDER BY `created_at` DESC
SELECT *
FROM `productos`
ORDER BY `producto_vendidos` DESC
---
    public function index()
    {
        $data['titulo'] = 'Inicio - MEGATECH';

        $categoria = new CategoriaModel();
        $productoModel = new ProductoModel();

        $data['categorias_dropdown'] = $categoria->findAll();
        $data['producto_dropdown'] = $productoModel->join('producto_categoria', 'producto_categoria.categoria_id = productos.producto_categoria')->findAll();

        $ultimosIngresos = $productoModel->orderBy('created_at', 'DESC')->findAll();

        $data['ingresos'] = $ultimosIngresos;

        $masVendidos = $productoModel->orderBy('producto_vendidos', 'DESC')->findAll();

SELECT *
FROM `productos`
JOIN `producto_categoria` ON `producto_categoria`.`categoria_id` = `productos`.`producto_categoria`
SELECT *
FROM `producto_categoria`
WHERE `categoria_id` = '5'
 LIMIT 1
SELECT *
FROM `productos`
WHERE `producto_categoria` = '5'
---
    public function vista_catalogo($id){

        $categoria = new CategoriaModel();
        $productoModel = new ProductoModel();

        $data['categorias_dropdown'] = $categoria->findAll();
        $data['producto_dropdown'] = $productoModel->join('producto_categoria', 'producto_categoria.categoria_id = productos.producto_categoria')->findAll();

        if($id === "0"){
            $data['categoria'] = $categoria->findAll();
            $data['producto'] = $productoModel->join('producto_categoria', 'producto_categoria.categoria_id = productos.producto_categoria')->findAll();

            $data['titulo'] = 'Catálogo - MEGATECH';
            echo view('/plantillas/header', $data);
            echo view('/plantillas/nav');
            echo view('catalogo_todos');
            echo view('/plantillas/footer');
        } else {
            $data['categoria'] = $categoria->where('categoria_id', $id)->first();
            $data['producto'] = $productoModel->where('producto_categoria', $id)->findAll();