proyecto_cruz_julian/app/Controllers/VentaController.php

SELECT *
FROM `productos`
JOIN `producto_categoria` ON `producto_categoria`.`categoria_id` = `productos`.`producto_categoria`
SELECT *
FROM `venta`
JOIN `personas` ON `personas`.`id_persona` = `venta`.`id_cliente`
---
    public function listar_ventas()
    {
        $ventas = new VentaModel();
        $detalle = new DetalleVentaModel();

        $categoria = new CategoriaModel();
        $productoModel = new ProductoModel();

        $data['categorias_dropdown'] = $categoria->findAll();
        $data['producto_dropdown'] = $productoModel->join('producto_categoria', 'producto_categoria.categoria_id = productos.producto_categoria')->findAll();

        $data['ventas'] = $ventas->join('personas', 'personas.id_persona = venta.id_cliente')->findAll();

SELECT *
FROM `productos`
JOIN `producto_categoria` ON `producto_categoria`.`categoria_id` = `productos`.`producto_categoria`
SELECT *
FROM `productos`
JOIN `producto_categoria` ON `producto_categoria`.`categoria_id` = `productos`.`producto_categoria`
ORDER BY `producto_vendidos` DESC
---
    public function listar_masVendidos()
    {
        $ventas = new VentaModel();
        $detalle = new DetalleVentaModel();

        $categoria = new CategoriaModel();
        $productoModel = new ProductoModel();

        $data['categorias_dropdown'] = $categoria->findAll();
        $data['producto_dropdown'] = $productoModel->join('producto_categoria', 'producto_categoria.categoria_id = productos.producto_categoria')->findAll();

        $masVendidos = $productoModel->join('producto_categoria', 'producto_categoria.categoria_id = productos.producto_categoria')->orderBy('producto_vendidos', 'DESC')->findAll();

SELECT *
FROM `productos`
JOIN `producto_categoria` ON `producto_categoria`.`categoria_id` = `productos`.`producto_categoria`
SELECT *
FROM `venta`
JOIN `personas` ON `personas`.`id_persona` = `venta`.`id_cliente`
WHERE `venta_id` = '10028'
 LIMIT 1
SELECT *
FROM `detalle_venta`
JOIN `venta` ON `venta`.`venta_id` = `detalle_venta`.`id_venta`
JOIN `productos` ON `productos`.`producto_id` = `detalle_venta`.`id_producto`
WHERE `detalle_venta`.`id_venta` = '10028'
---
    public function ver_detalle($id=null) {
        $detalle = new DetalleVentaModel();
        $venta = new VentaModel();

        $categoria = new CategoriaModel();
        $productoModel = new ProductoModel();

        $data['categorias_dropdown'] = $categoria->findAll();
        $data['producto_dropdown'] = $productoModel->join('producto_categoria', 'producto_categoria.categoria_id = productos.producto_categoria')->findAll();

        $data['venta'] = $venta->where('venta_id', $id)->join('personas', 'personas.id_persona = venta.id_cliente')->first();

        $data['detalle'] = $detalle->where('detalle_venta.id_venta', $id)->join('venta', 'venta.venta_id = detalle_venta.id_venta')->join('productos', 'productos.producto_id = detalle_venta.id_producto')->findAll();